{
  "name": "AskUbuntuCorpus",
  "locale": "en-us",
  "data": [
    {
      "intent": "Software Recommendation",
      "utterances": [
        "Any command line calculator for Ubuntu?",
        "Extracting embedded images from a PDF",
        "What to use to quickly cut Audio/Video",
        "MySQL GUI Tools",
        "What developer text editors are available for Ubuntu?",
        "What screenshot tools are available?",
        "Which programs can I use to edit PDF files?",
        "Is there a lightweight tool to crop images quickly?",
        "What IRC clients are available?",
        "What new games are available for Ubuntu in 2011?",
        "UPNP / DLNA (client) player recommendations?",
        "What scientific plotting software is available?",
        "Can you recommend a password generator?",
        "What tools do you use to monitor a web server?",
        "What is a good MongoDB GUI client?",
        "Password Management Applications?",
        "Is there an application for reading mobi files?"
      ],
      "tests": [
        "What software can I use to view epub documents?",
        "Which PDF Viewer would you recommend?",
        "What IDEs are available for Ubuntu?",
        "What's the best Mind Mapping Software?",
        "Software to read a QR code?",
        "PDF to word conversion software?",
        "Is there software that can view .dwg files?",
        "What are some good PHP editors?",
        "Is there a software utility to adjust screen gamma/brightness/contrast?",
        "Please recommend a hex editor for shell",
        "Is there LAN topology mapping software available in Ubuntu?",
        "Is there a tool like wifi analyzer for ubuntu?",
        "Tool for recovering deleted data from a flash drive",
        "What's a simple \"colour picker\" app for GNOME?",
        "Any app that tells me to take regular breaks from working?",
        "What are some good ASCII art generators?",
        "What are some good GUI binary viewers/editors?",
        "Which is the best PDF metadata viewer for Ubuntu?",
        "Is there a Linux file manager with a proper drop-down tree view? (like finder in OS X)",
        "Which application do you recommend for watching TV (DVB)?",
        "What Is The Best HDR Software?",
        "What do you use to edit Microsoft Word documents (docx)?",
        "What's the best Wireframing tool?",
        "Is there any software that will do face recognition in photos?",
        "Applications to replace iTunes for iPod synchronization?",
        "Is there an SSH connection manager?",
        "A light alternative to gnome-system-monitor?",
        "Software to create a video slideshow?",
        "Is there a project management software for Ubuntu like Microsoft Project?",
        "Is there any recovery software available for ext4?",
        "What blog editor software are available?",
        "Can you recommend a good modern GUI download manager (wget wrapper?)",
        "Is there any program for fuzzy string matching which provides a match score?",
        "Are there any hardware diagnostic tools?",
        "Recommendation for Regex editor?",
        "Is it recommended to upgrade to Lubuntu 15.04?",
        "On really old Ubuntu 6.06 - How to upgrade",
        "Wubi Device /dev/loop0 full. How to get more space?",
        "Removing Recently used items in 12.04",
        "In Unity how do I see the details of a given launcher?"
      ]
    },
    {
      "intent": "None",
      "utterances": [
        "How to record my screen?",
        "How can I highlight or annotate PDFs?",
        "Torrent client for the command-line?"
      ],
      "tests": [
        "Is there a Document scanning and archiving software?",
        "How is rm command different from the delete button?",
        "How to provide user permission to read and write on /dev/sdax? What is the syntax?",
        "Security enhancements prevent mounting /dev/sdb1",
        "How do I show grub when resuming from suspend?"
      ]
    },
    {
      "intent": "Shutdown Computer",
      "utterances": [
        "shut down without extra question",
        "How to shutdown computer when users are logged on?",
        "What is the proper terminal-way to shutdown?",
        "How can I automatically shutdown the system after a specific time?",
        "Hotkey to shut down from login screen?",
        "How to shutdown the computer after Xsession ends?",
        "How can one shutdown a PC using the keyboard?",
        "How can I enable shutdown verbosity?",
        "Are there any Keyboard Shortcuts to Shutdown?",
        "Shutdown after a certain time",
        "Shutdown problem in Ubuntu 16.04",
        "How do I fix a shutdown problem?",
        "What graphical utility can I use for Ubuntu auto shutdown?"
      ],
      "tests": [
        "Keyboard shortcut to shutdown?",
        "My system doesn't go shutdown",
        "How to troubleshoot slow shutdown?",
        "How can I shutdown the computer when a certain process ends?",
        "Ubuntu Shut down app",
        "What does my computer do when I click 'Shut Down'?",
        "How do I shut down without the confirmation prompt?",
        "No action when shutdown pressed",
        "what is the right way to shutdown ubuntu using the command line?",
        "How can I make shutdown not require admin password?",
        "shutdown in specific way if no-one uses computer",
        "What is the command to open the shutdown dialog?",
        "How to Shut down Ubuntu by using keyboard?",
        "shutdown 5:30pm every day"
      ]
    },
    {
      "intent": "Make Update",
      "utterances": [
        "Is it worth upgrading from 12.04 LTS to 13.04",
        "Upgrade to 12.04 64 bit",
        "How to upgrade Ubuntu 14.04.1 to 14.04.2?",
        "Upgrading from Ubuntu 14.04 to 15.04",
        "how to upgrade from ubuntu 15.04 to 15.10?",
        "Upgrade 12.04 to 12.10 using startup disk",
        "How to Upgrade from 11.10 to 12.04 when you've got a problem?",
        "Update 11.04 to 12.04 with LiveCD",
        "How to upgrade Ubuntu 9.10 to 12.10 via terminal?",
        "How to upgrade from Ubuntu 10.10 to 11.04?"
      ],
      "tests": [
        "Upgrading from 11.10 to 12.04",
        "How do I upgrade to the release version of 16.04 if I am running Beta?",
        "Doubts regarding the 15.04 upgrade (is it inevitable and unavoidable?)",
        "Is any offline upgrade from 13.10 to 14.04 possible?",
        "Upgrading from ubuntu 12.04 to 13.10",
        "Ubuntu upgrade failed",
        "Upgrading from 12.04 to 13.10 ( Unanswered questions )",
        "upgrading to Ubuntu 13.10 from Ubuntu 13.04",
        "Force upgrade 12.10 to 13.04",
        "How to partially upgrade Ubuntu 11.10 from Ubuntu 11.04?",
        "Problem upgrading Ubuntu 9.10",
        "Is it necessary to upgrade to 15.10 from 14.04?",
        "How do I update Xubuntu 11.10 to Xubuntu 12.04 LTS?",
        "Why did the upgrade from 11.10 to 12.04 ruin my system?",
        "Problems upgrading from 12.04 to 14.04",
        "Problems upgrading Ubuntu 12.10 to 13.04",
        "Upgrade from 12.04 to 12.10 without losing files?",
        "Do I need to uninstall 10.04 to upgrade to 12.04?",
        "Do I need to reinstall everything to upgrade from 13.10 to 14.10?",
        "update-manager: upgrade to 15.04 rather than 16.04",
        "Upgrading 16.04 to 16.04.1",
        "Upgrading Ubuntu Server 9.10 to 10.04",
        "Ho do I update to 13.04 from the beta?",
        "How to upgrade from 12.10 to 14.04",
        "Upgrading from 10.10 to 11.04 how much space is needed?",
        "Do I need to backup my 12.04 system to upgrade to 12.04.1?",
        "Cannot upgrade from 12.04LTS to 14.04",
        "Upgrade 10.10 to 11.04",
        "How to upgrade from 14.04 LTS or 15.10 to 16.04 from terminal",
        "How to upgrade from 16.04 LTS to 16.04.1 LTS",
        "Upgrading from 10.04 to 11.10",
        "How can i upgrade to Ubuntu 14.04 final from 14.04 Beta correctly?",
        "Is there an upgrade procedure from 12.04 LTS to 14.04 LTS",
        "Upgrade from 9.10 to 11.04",
        "How to upgrade Ubuntu 12.04 to 14.04 if I have dual boot with windows 7?",
        "Using 12.04 can I compile packages with gcc for 10.04?",
        "Upgrading From 11.04 (32bit) to 12.04 (64bit)"
      ]
    },
    {
      "intent": "Setup Printer",
      "utterances": [
        "No matter what I do Ubuntu 15.04 does not recognize HP LaserJet 1020",
        "How to setup HP printer/scanner on ubuntu?",
        "How do I setup my HP C4140 printer wirelessly?",
        "How to setup wireless printing from a printer connected via usb on Ubuntu Server 12.10?",
        "How can I install a Pantum 2502W laser printer on Ubuntu",
        "Install Canon MP560 Ubuntu 15.04",
        "How to install a Brother MFC-5890CN network printer?",
        "How do I install drivers for a Konica Minolta 200?",
        "How do I install drivers for the Panasonic MB1900CX All-in-One Printer/Scanner?",
        "How To Install Canon LBP2900B printer in 14.04 LTS ? I tried the method for LBP2900 but it didnt work"
      ],
      "tests": [
        "How to install a Lexmark z600 series printer?",
        "Cannot setup HP All in one DJ3630",
        "How to add a network printer on Ubuntu 15.10?",
        "Cannot install printer driver epson l210",
        "How do I install Dell 2150cdn printer",
        "Installing Epson XP-424 wireless printer",
        "Installing EPSON L355 on Ubuntu 14.04",
        "How do I install the HP F4280 printer?",
        "How to Install Brother DCP-8110DN Laser Printer on Ubuntu?",
        "How to Install a Canon MF8040Cn Printer on Ubuntu 12.04",
        "How Do I Install Canon MF8000C Printer in Ubuntu 15.10?",
        "How to install Canon LBP330 in Lts 16.04",
        "Install printer Lexmark X4690 (ubuntu 12.04)"
      ]
    }
  ]
}